HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_bf.h
/**
 * \file IfxGeth_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Geth_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Geth_Registers
 * 
 */
#ifndef IFXGETH_BF_H
#define IFXGETH_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Geth_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_GETH_MAC_CONFIGURATION_RE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_GETH_MAC_CONFIGURATION_RE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_GETH_MAC_CONFIGURATION_RE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_GETH_MAC_CONFIGURATION_TE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_GETH_MAC_CONFIGURATION_TE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_GETH_MAC_CONFIGURATION_TE_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_GETH_MAC_CONFIGURATION_PRELEN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_GETH_MAC_CONFIGURATION_PRELEN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_GETH_MAC_CONFIGURATION_PRELEN_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_GETH_MAC_CONFIGURATION_DC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_GETH_MAC_CONFIGURATION_DC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_GETH_MAC_CONFIGURATION_DC_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_GETH_MAC_CONFIGURATION_BL_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_GETH_MAC_CONFIGURATION_BL_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_GETH_MAC_CONFIGURATION_BL_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_GETH_MAC_CONFIGURATION_DR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_GETH_MAC_CONFIGURATION_DR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_GETH_MAC_CONFIGURATION_DR_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_GETH_MAC_CONFIGURATION_DCRS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_GETH_MAC_CONFIGURATION_DCRS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_GETH_MAC_CONFIGURATION_DCRS_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_GETH_MAC_CONFIGURATION_DO_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_GETH_MAC_CONFIGURATION_DO_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_GETH_MAC_CONFIGURATION_DO_OFF (10u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.ECRSFD */
#define IFX_GETH_MAC_CONFIGURATION_ECRSFD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.ECRSFD */
#define IFX_GETH_MAC_CONFIGURATION_ECRSFD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.ECRSFD */
#define IFX_GETH_MAC_CONFIGURATION_ECRSFD_OFF (11u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_GETH_MAC_CONFIGURATION_LM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_GETH_MAC_CONFIGURATION_LM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_GETH_MAC_CONFIGURATION_LM_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_GETH_MAC_CONFIGURATION_DM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_GETH_MAC_CONFIGURATION_DM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_GETH_MAC_CONFIGURATION_DM_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_GETH_MAC_CONFIGURATION_FES_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_GETH_MAC_CONFIGURATION_FES_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_GETH_MAC_CONFIGURATION_FES_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_GETH_MAC_CONFIGURATION_PS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_GETH_MAC_CONFIGURATION_PS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_GETH_MAC_CONFIGURATION_PS_OFF (15u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_GETH_MAC_CONFIGURATION_JE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_GETH_MAC_CONFIGURATION_JE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_GETH_MAC_CONFIGURATION_JE_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_GETH_MAC_CONFIGURATION_JD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_GETH_MAC_CONFIGURATION_JD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_GETH_MAC_CONFIGURATION_JD_OFF (17u)

