HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_GLBLUCAST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_GLBLUCAST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_GLBLUCAST_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPFE */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPFE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPFE */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPFE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPFE */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPFE_OFF (10u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPTR */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPTR_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPTR */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPTR_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPTR */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPTR_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKFILTRST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKFILTRST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKFILTRST_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_RWK_PACKET_FILTER_Bits.WKUPFRMFTR */
#define IFX_GETH_MAC_RWK_PACKET_FILTER_WKUPFRMFTR_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_RWK_PACKET_FILTER_Bits.WKUPFRMFTR */
#define IFX_GETH_MAC_RWK_PACKET_FILTER_WKUPFRMFTR_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_RWK_PACKET_FILTER_Bits.WKUPFRMFTR */
#define IFX_GETH_MAC_RWK_PACKET_FILTER_WKUPFRMFTR_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter0_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER0_COMMAND_LEN (4u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter0_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER0_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter0_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER0_COMMAND_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter1_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER1_COMMAND_LEN (4u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter1_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER1_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter1_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER1_COMMAND_OFF (8u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter2_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER2_COMMAND_LEN (4u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter2_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER2_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter2_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER2_COMMAND_OFF (16u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter3_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER3_COMMAND_LEN (4u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter3_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER3_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter3_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER3_COMMAND_OFF (24u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter0_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER0_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter0_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER0_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter0_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER0_OFFSET_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter1_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER1_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter1_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER1_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter1_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER1_OFFSET_OFF (8u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter2_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER2_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter2_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER2_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter2_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER2_OFFSET_OFF (16u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter3_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER3_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter3_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER3_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter3_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER3_OFFSET_OFF (24u)

/** \brief Length for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter0_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER0_CRC_LEN (16u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter0_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER0_CRC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter0_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER0_CRC_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter1_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER1_CRC_LEN (16u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter1_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER1_CRC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter1_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER1_CRC_OFF (16u)

/** \brief Length for Ifx_GETH_RWK_FILTER_BYTE_MASK_Bits.Filteri_Byte_Mask */
#define IFX_GETH_RWK_FILTER_BYTE_MASK_FILTERI_BYTE_MASK_LEN (32u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_BYTE_MASK_Bits.Filteri_Byte_Mask */
#define IFX_GETH_RWK_FILTER_BYTE_MASK_FILTERI_BYTE_MASK_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_BYTE_MASK_Bits.Filteri_Byte_Mask */
#define IFX_GETH_RWK_FILTER_BYTE_MASK_FILTERI_BYTE_MASK_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEN_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEX_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEX_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEX_OFF (1u)

