HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXJABERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXJABERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXJABERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXJABERPIS_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_OFF (9u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXOSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXOSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXOSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX64OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX64OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX64OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX65T127OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX65T127OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX65T127OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX128T255OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX128T255OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX128T255OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX256T511OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX256T511OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX256T511OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_OFF (14u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX512T1023OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX512T1023OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX512T1023OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_OFF (15u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUCGPIS_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLENERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLENERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLENERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLENERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLENERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLENERPIS_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXORANGEPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXORANGEPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXORANGEPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXORANGEPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXORANGEPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXORANGEPIS_OFF (19u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXPAUSPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXPAUSPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXPAUSPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXPAUSPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXPAUSPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXPAUSPIS_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXFOVPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXFOVPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXFOVPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXFOVPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXFOVPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXFOVPIS_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXVLANGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXVLANGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXVLANGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXVLANGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXVLANGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXVLANGBPIS_OFF (22u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXWDOGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXWDOGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXWDOGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXWDOGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXWDOGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXWDOGPIS_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRCVERRPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRCVERRPIS_LEN (1u)

