HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCOLGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCOLGPIS_OFF (15u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXDEFPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXDEFPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXDEFPIS_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLATCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLATCOLPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLATCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLATCOLPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLATCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLATCOLPIS_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXCOLPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXCOLPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXCOLPIS_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXCARERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXCARERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXCARERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXCARERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXCARERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXCARERPIS_OFF (19u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGOCTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGOCTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGOCTIS_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGPKTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGPKTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGPKTIS_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXDEFPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXDEFPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXDEFPIS_OFF (22u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXPAUSPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXPAUSPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXPAUSPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXPAUSPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXPAUSPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXPAUSPIS_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXVLANGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXVLANGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXVLANGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXVLANGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXVLANGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXVLANGPIS_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXOSIZEGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXOSIZEGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXOSIZEGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPIUSCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPIUSCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPIUSCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPIUSCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPIUSCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPIUSCIS_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPITRCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPITRCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPITRCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPITRCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPITRCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPITRCIS_OFF (27u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBPKTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBPKTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBPKTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXBCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXBCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXBCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_OFF (3u)

